#include <stdio.h>

int main()
{
    int x = 10;
    int y = 10;
    int true = x && y & x << 1; //операциите
                                // се изпълняват от ляво на дясно , 
                                //но << е с най голям приоритет(ь е равен на 20), след което получваме 0 от y&x и   от x&&0.
    printf("True = %d\n", true);
    true = x && y ^ x << 1;     //операциите
                                // се изпълняват от ляво на дясно , 
                                //но << е с най голям приоритет(ь е равен на 10), след което получваме 10 от y&x и 1  от x&&10.
    printf("True = %d ", true);

    return 0;
}