/*Напишете функцията int linSearch(int a[], int l, int d),
която получава като първи аргумент началото на масив а, втория
аргумент е дължината на масива, а третия аргумент е числото,
което търсим. Претърсете масива елемент по елемент и ако
някой елемент съвпада с търсеното число върнете позицията на
която се намира този елемент. В противен случай върнете – 1*/
#include <stdio.h>
int linSearch(int a[], int l, int d)
{
    int i = 0, result = -1;
    while (i < l)
    {
        if (a[i] == d)
        {
            result = i;
            break;
        }
        i++;
    }
    return result;
}

int main(void)
{

    int a[] = {1, 2, 7, 9, 11, 255};
    printf("%d", linSearch(a, 6, 7));

    return 0;
}
