/*Дефинирайте масив int с 10 елемента. Дефинирайте
пойнтер, който ще сочи към масива. Насочете пойнтера към масива. Нужно
ли е да използвате &? Какво представлява името на масива? Какво сочи?
Колко начина има за да изпишете насочването на пойнтера към масива.
Има ли разлика между тях.*/
#include <stdio.h>

int main(void)
{

    int n[10] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10};
    int *point = NULL;
    point = n;
    printf("%d\n", point[3]);
    point = &n[5];
    printf("%d\n", point[3]);

    return 0;
}