/*Напишете функцията void our_strcat(char *s, char *t), която
добавя (конкатенира) стринга t в края на стринга s. С един фор цикъл трябва
да се стигне до края на низа s и след това на всяка следваща трябва да се
копират елементите на низа t. Функцията strcat() предполага, че има
достатъчно в s за да се копират всички стойности на низа t, защото иначе
оператор за присвояване може да работи извън размера на масива и да
имаме грешка. Но не сме разгледали динамичното заделяне на памет с
malloc.


*/

#include <stdio.h>

int our_strcmp(char *s, char *t)
{

    while (*s != '\0')
    {
        if (*t == '\0')
              return *s-*t;
        if (*t > *s)
             return *s-*t;
        if (*s > *t)
            return *s-*t;

        s++;
        t++;
    }

    if (*t != '\0')
          return *s-*t;

    return 0;
}

int main(void)
{

    char s[] = "hello world!";
    char t[] = "hello aorld!";
    printf("%d", our_strcmp(s, t));

    return 0;
}