/*Напишете програма, която умножава 2 числа, като
използва пойнтер-и.
Пойнтер-ите не са страшни. Дефинират се като
тип *Х и се използват като *Х. Както променливите,
но със * отпред (и 1 наум!).
Продължение: Опитайте да умножите 2 променливи от
различен тип, използвайки пойнтери.*/
#include <stdio.h>

int main(){
    int a = 3;
    int* iA = &a;
    int b = 5;
    int* iB = &b;
    *iA *= *iB;
    printf("%d",a);

    double d = 3.3;
    double* iD = &d;
    *iD *= *iA;
    printf("\n%g",d);

 return 0;
}