/*Дефинираме променлива “а“, дефинираме
пойнтер, но още не му задаваме стойност. Отпечатайте
адреса на “а”. След това присвояваме стойност на
пойнтера, като внимаваме типовете на пойнтера и
променливата да са от един и същи тип. Отпечатваме
на екрана стойността на пойнтера с %р, стойността на
„а“ с %d, стойността на *ptr с %d.*/
#include <stdio.h>

int main(int argc, char **argv)
{
    int a = 5;
    int *b;
    printf("%p\n", &a);
    b = &a;
    printf("%p\n", *b);
    printf("%d\n", a);
    printf("%d\n", *b);
    return 0;
}